trade_exp/src/DataProcessors/РаботаСФайлами/РаботаСФайлами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="20feb794-eb05-46a6-90e7-ca4e2376d7b2">
  <name>РаботаСФайлами</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

trade_exp/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="498b2f25-6aa5-4645-9e67-8fb628c230a2">
    <name>ПолнаяИнформацияФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bed3672-f007-4c00-b791-0b7ebd647c22">
    <name>ИнформацияФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91d3583a-c05d-459c-9f83-fbfeb62fca07">
    <name>ДатаОбновленияДанныхФНС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9905e69a-09d1-4783-b0d4-a021c2f92565">
    <name>Выручка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>25</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d17fbf5-4cee-45fc-8af7-13db85700ccc">
    <name>ПлательщикНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df919cae-c1ba-4fe1-972e-d4222ab0005d">
    <name>КоличествоРаботников</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0800e2e-b103-41a7-a887-ca049af6677e">
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5729a90-7b03-4912-9990-210602af51f1">
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="2629d638-1c9b-4112-b68e-0560bb2d997b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c62fe487-31b1-4ebb-b1a8-ad1821952696">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9a6552a-9493-4353-953b-2f7c777b2f61">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="21ef8fb5-99ad-409e-9d21-398379db456f">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72d876b9-29ff-4c5d-bb87-ac07cd9adf4b">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9ee408c3-a4d4-4570-bc13-b6b4193f889a">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="689cf9d5-3c38-4e84-8e8e-c5bad88bbac8">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="48ac22c5-5bfb-458e-a816-f8ebffd836d8">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7ceb314a-6d3d-4eb9-927d-ec92d5e2ffd3">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="055bd074-c785-404d-a8d5-827b2754f483">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7027a1ee-60c1-471c-aee1-a34bdb899465">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="366f1557-22c4-4832-947b-6020579affac">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="09809d0f-5b0e-46d3-b7b7-24065f75b724">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa7aa1c6-abc3-4421-b0ea-7d82a073d157">
      <name>ДействуетС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="07295009-77c8-4b40-8a9e-62debe0887c6">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f624df26-f68d-4892-b33d-cf2ef3cdaa0c">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="987ffccd-246d-49b8-a223-e53d76678887">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="861931ca-dadf-424e-9e87-cc6fec41bf47">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d3fe16d0-c615-4822-a095-1678933639d4">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/DataProcessors/РаботаСФайлами/Forms/ПрисоединенныйФайл/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЗаполнитьРеквизиты();
	ОбновитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость()
	Элементы.ГруппаФайлыПарнера.Видимость = ((ТипЗнч(ЭтотОбъект.Объект.ВладелецФайла) = Тип("СправочникСсылка.Партнеры")) Или (ТипЗнч(ЭтотОбъект.Объект.ВладелецФайла) = Тип("СправочникСсылка.ДоговорыКонтрагентов")));
	Элементы.ГрПарнеры.Видимость = (ТипЗнч(ЭтотОбъект.Объект.ВладелецФайла) = Тип("СправочникСсылка.Партнеры"));
	Элементы.ГрДоговоры.Видимость = (ТипЗнч(ЭтотОбъект.Объект.ВладелецФайла) = Тип("СправочникСсылка.ДоговорыКонтрагентов"));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизиты()
	Если ТипЗнч(ЭтотОбъект.Объект.ВладелецФайла) = Тип("СправочникСсылка.Партнеры") Тогда
		ВидФайла = ЭтотОбъект.Объект.ВидФайла;
		Контрагент = ЭтотОбъект.Объект.Контрагент;
		
		Если Контрагент.Пустая() Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Партнер = &ВыбПартнер
			|	И Контрагенты.ПометкаУдаления = ЛОЖЬ"
			;
			Запрос.УстановитьПараметр("ВыбПартнер",ЭтотОбъект.Объект.ВладелецФайла);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				Контрагент = Выборка.Ссылка;
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ЭтотОбъект.Объект.ВладелецФайла) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ВидФайла = ЭтотОбъект.Объект.ВидФайла;
		Если ВидФайла.Пустая() Тогда ВидФайла = Справочники.ВидыФайловПартнера.Договор КонецЕсли;
		ДнейОтсрочки = ЭтотОбъект.Объект.ДнейОтсрочки;
		ЛимитСезон = ЭтотОбъект.Объект.ЛимитСезон;
		ЛимитНеСезон = ЭтотОбъект.Объект.ЛимитНеСезон;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Док_ВидФайловПартнераПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Док_КонтрагентПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Док_ДнейОтсрочкиПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Док_ЛимитСезонПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Док_ЛимитНеСезонПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

//Изменения - запись добавленных рекизитов файла
&Вместо("ЗаписатьФайл") 
Функция ЗаписатьФайлДоп(Знач ПараметрОбъект = Неопределено)
	
	Если ПараметрОбъект = Неопределено Тогда
		ЗаписываемыйОбъект = РеквизитФормыВЗначение("Объект");
	Иначе
		ЗаписываемыйОбъект = ПараметрОбъект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		НачатьТранзакцию();
		Попытка
			ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ЗначениеКопирования);
			ТипХраненияФайла = РаботаСФайламиСлужебный.ТипХраненияФайла(ЗначениеКопирования.Размер, ЗначениеКопирования.Расширение);
			Если ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
				СсылкаНового = Справочники[ИмяСправочника].ПолучитьСсылку();
				ЗаписываемыйОбъект.УстановитьСсылкуНового(СсылкаНового);
				РаботаСФайламиСлужебный.ЗаписатьФайлВИнформационнуюБазу(СсылкаНового, ДвоичныеДанные);
				ЗаписываемыйОбъект.ТипХраненияФайла = ТипХраненияФайла;
			Иначе
				// +Альтерра
				СведенияОФайле = РаботаСФайламиСлужебный.ДобавитьФайлВТом(ДвоичныеДанные, ЗаписываемыйОбъект.ДатаМодификацииУниверсальная,
				ЗаписываемыйОбъект.Наименование, ЗаписываемыйОбъект.Расширение); 
				ЗаписываемыйОбъект.Том              = СведенияОФайле.Том;
				ЗаписываемыйОбъект.ПутьКФайлу       = СведенияОФайле.ПутьКФайлу;
				ЗаписываемыйОбъект.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВТомахНаДиске;
				// -
				
				// -Альтерра
				//	ЗаписываемыйОбъект.Том = Неопределено;
				// 	ЗаписываемыйОбъект.ПутьКФайлу = Неопределено;
				//	ЗаписываемыйОбъект.ТипХраненияФайла = Неопределено;
				//   РаботаСФайламиВТомахСлужебный.ДобавитьФайл(ЗаписываемыйОбъект, ДвоичныеДанные);
				// -
			КонецЕсли;
			
			Если ДоступнаЭлектроннаяПодпись Тогда
				РаботаСФайламиСлужебный.ПеренестиРезультатыПроверкиПодписей(ЭлектронныеПодписи, ЗначениеКопирования);
			КонецЕсли;
			
			ЗаписываемыйОбъект.Записать();
			
			Если ДоступнаЭлектроннаяПодпись И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
				МодульЭлектроннаяПодпись = ОбщегоНазначения.ОбщийМодуль("ЭлектроннаяПодпись");
				
				СертификатыИсточника = МодульЭлектроннаяПодпись.СертификатыШифрования(ЗначениеКопирования);
				МодульЭлектроннаяПодпись.ЗаписатьСертификатыШифрования(ЗаписываемыйОбъект, СертификатыИсточника);
				
				УстановленныеПодписи = МодульЭлектроннаяПодпись.УстановленныеПодписи(ЗначениеКопирования);
				МодульЭлектроннаяПодпись.ДобавитьПодпись(ЗаписываемыйОбъект, УстановленныеПодписи);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	Иначе
		НачатьТранзакцию();
		Попытка
			Если ДоступнаЭлектроннаяПодпись Тогда
				РаботаСФайламиСлужебный.ПеренестиРезультатыПроверкиПодписей(ЭлектронныеПодписи, ЗаписываемыйОбъект.Ссылка);
			КонецЕсли;
			
			// +Альтерра dr ExZ запись добавленных реквизитов
			Если ТипЗнч(ЗаписываемыйОбъект.ВладелецФайла) = Тип("СправочникСсылка.Партнеры") Тогда
				ЗаписываемыйОбъект.ВидФайла = ВидФайла; 
				ЗаписываемыйОбъект.Контрагент = Контрагент; 
			ИначеЕсли ТипЗнч(ЗаписываемыйОбъект.ВладелецФайла) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				ЗаписываемыйОбъект.ВидФайла = ВидФайла; 
				ЗаписываемыйОбъект.ДнейОтсрочки = ДнейОтсрочки;
				ЗаписываемыйОбъект.ЛимитСезон = ЛимитСезон;
				ЗаписываемыйОбъект.ЛимитНеСезон = ЛимитНеСезон;
			КонецЕсли;	
			// -
			
			ЗаписываемыйОбъект.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
	Если ПараметрОбъект = Неопределено Тогда
		ЗначениеВРеквизитФормы(ЗаписываемыйОбъект, "Объект");
	КонецЕсли;
	
	ЗначениеКопирования = Справочники[ИмяСправочника].ПустаяСсылка();
	УстановитьДоступностьКнопок(ЭтотОбъект, Элементы);
	ОбновитьЗаголовок();
	
	Возврат Истина;
	
КонецФункции

//Отбор по партнеру
&НаКлиенте
Процедура Док_КонтрагентНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Партнер",ПолучитьПартнера());
	
	ПараметрыФормы = Новый Структура("Отбор",ПараметрыОтбора);
	
	ОбработкаВыбораКонтрагента = Новый ОписаниеОповещения("ВыборЭлементаСправочникаКонтрагентыКонец",ЭтаФорма);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОбработкаВыбораКонтрагента);
КонецПроцедуры

&НаСервере
Функция ПолучитьПартнера()
	Возврат ЭтаФорма.Объект.ВладелецФайла;
КонецФункции	

&НаКлиенте
Процедура ВыборЭлементаСправочникаКонтрагентыКонец(Значение,ДопПараметры) Экспорт
	Если Не Значение = Неопределено Тогда
		Контрагент = Значение;
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
&Вместо("ОбработатьКомандуЗаписиФайла")
Функция Док_ОбработатьКомандуЗаписиФайла()        
	
	// +Альтерра
	Если ЭтотОбъект.ИмяСправочника = "ПартнерыПрисоединенныеФайлы" ИЛИ ЭтотОбъект.ИмяСправочника = "ДоговораКонтрагентовПрисоединенныеФайлы" Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ВидФайла) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для продолжения укажите вид файла.'"), , "ВидФайла");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ЭтотОбъект.ИмяСправочника = "ПартнерыПрисоединенныеФайлы" Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для продолжения укажите контрагента.'"), , "Контрагент");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;    
	// -
	
	Результат = ПродолжитьВызов();
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Док_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка= Ложь;
	
	Если ЭтотОбъект.ИмяСправочника = "ПартнерыПрисоединенныеФайлы" ИЛИ ЭтотОбъект.ИмяСправочника = "ДоговораКонтрагентовПрисоединенныеФайлы" Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ВидФайла) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для продолжения укажите вид файла.'"), , "ВидФайла");
			Отказ= Истина;
		КонецЕсли;
	КонецЕсли;

	Если ЭтотОбъект.ИмяСправочника = "ПартнерыПрисоединенныеФайлы" Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для продолжения укажите контрагента.'"), , "Контрагент");
			Отказ= Истина;
		КонецЕсли;
	КонецЕсли;

	Если Модифицированность Тогда
		Оповещение= Новый ОписаниеОповещения("ЗаписатьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Элемент изменен. Записать?", РежимДиалогаВопрос.ДаНет, 10, , "Записать");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьКомандуЗаписиФайла();
	КонецЕсли;
КонецПроцедуры
